fix: basic endpoint addition guide corrections
